## Plan for org_account/main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_securityhub_account.org will be destroyed
  # (because aws_securityhub_account.org is not in configuration)
  - resource "aws_securityhub_account" "org" {
      - id = "659087519042" -> null
    }

  # aws_securityhub_invite_accepter.aft_management will be created
  + resource "aws_securityhub_invite_accepter" "aft_management" {
      + id            = (known after apply)
      + invitation_id = (known after apply)
      + master_id     = (known after apply)
    }

  # aws_securityhub_invite_accepter.audit will be created
  + resource "aws_securityhub_invite_accepter" "audit" {
      + id            = (known after apply)
      + invitation_id = (known after apply)
      + master_id     = (known after apply)
    }

  # aws_securityhub_member.aft_management is tainted, so must be replaced
-/+ resource "aws_securityhub_member" "aft_management" {
      + email         = "aws-cloud-pb-ct+sh@cds-snc.ca"
      ~ id            = "137554749751" -> (known after apply)
      ~ master_id     = "274536870005" -> (known after apply)
      ~ member_status = "Enabled" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_securityhub_member.audit is tainted, so must be replaced
-/+ resource "aws_securityhub_member" "audit" {
      + email         = "aws-cloud-pb-ct+sh@cds-snc.ca"
      ~ id            = "886481071419" -> (known after apply)
      ~ master_id     = "274536870005" -> (known after apply)
      ~ member_status = "Enabled" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_guardduty_detector.detector_ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_guardduty_detector.detector_us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_guardduty_detector.detector_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

27 tests, 17 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
